// ============================================================================
// Error strings
// ----------------------------------------------------------------------------
"ERROR_BOOTVOL" = "Овој софтвер треба да биде инсталиран за да продолжите понатака.";
"ERROR_INSTALL" = "Овој дел не одговара на барањата за надоградба.";

"Newer_Package_Installed_message" = "Понова верзија на Chameleon е веќе инсталирана.";
"Intel_Mac_message" = "Софтверот не може да биде инсталиран на овој компјутер.";


// ============================================================================
// Bootloader
// ----------------------------------------------------------------------------
"Chameleon_title" = "Chameleon";
"Chameleon_description" = "Chameleon-от има потреба од три основни датотеки. (едноставно)
boot0 (Во MBR на драјвот) одговорен за вчитување на boot1.
boot1 (Во boot-секторот на партицијата) за пронаоѓање на boot2.
boot2 (Во root папката на партицијата) за вчитување на kernel-от итн.";

"Standard_title" = "Chameleon Стандард";
"Standard_description" = "Стандардна инсталација на Chameleon";

"EFI_title" = "EFI";
"EFI_description" = "Install Chameleon's files to the normally hidden EFI partition using either boot0 or boot0md depending on your system and without destroying any existing Windows installation if you have one.";

"noboot_title" = "Ништо";
"noboot_description" = "Не инсталирај Chameleon (корисно за инсталација само на Extra компоненти)";


// ============================================================================
// Modules
// ----------------------------------------------------------------------------
"Module_title" = "Modules";
"Module_description" = "The modules system incorporated in chameleon allows for a user or developer to extend the core functionality of chameleon without replacing the main boot file. ";

"AMDGraphicsEnabler_title" = "AMDGraphicsEnabler";
"AMDGraphicsEnabler_description" = "The GraphicsEnabler ATI code ( > r784) ported to a module.
This code has no support for 'legacy' ATI cards.
If your HD card was supported on the old code and you find
it missing on this, please file an issue at:
http://forge.voodooprojects.org/p/chameleon/issues/
The same applies to any missing card on this code.
Only cards known to work will be added.";

"ATiGraphicsEnabler_title" = "ATiGraphicsEnabler";
"ATiGraphicsEnabler_description" = "The GraphicsEnabler ATI code ( < r784) ported to a module.
Support for 'legacy' cards...
Based on Meklort's work.";

"IntelGraphicsEnabler_title" = "IntelGraphicsEnabler";
"IntelGraphicsEnabler_description" = "Enables a few Intel cards to be used out of the box, mostly mobile ones.";

"klibc_title" = "klibc";
"klibc_description" = "This module provides a standard c library for modules to link to if the library provided by chameleon is insufficient.
This is currently only used by the uClibc++ library.
Source: http://www.kernel.org/pub/linux/libs/klibc/";

"AutoReso_title" = "Resolution";
"AutoReso_description" = "This module reads the edid information from the monitor attached to the main display.
The module is currently not integrated into trunk and has minimal uses as it stands.
Additionally, the module will patch the vesa modes available in pre intel hd graphics cards to provide proper resolution while booting.";

"NVIDIAGraphicsEnabler_title" = "NVIDIAGraphicsEnabler";
"NVIDIAGraphicsEnabler_description" = "The GraphicsEnabler nVidia code ported to a module.
If your card is supported and you find it missing on this code, please file an issue at:
http://forge.voodooprojects.org/p/chameleon/issues/
Only cards known to work will be added.";

"uClibc_title" = "uClibc++";
"uClibc_description" = "This module provides a minimalistic c++ runtime library for use in other modules.
This does not provide functionality by itself, instead it is used to allow for the c++ language to be used in other modules.
Please note that rtti and exceptions has both been disabled.
Source: http://cxx.uclibc.org/
Dependencies: klibc";

"Keylayout_title" = "Keylayout";
"Keylayout_description" = "This module permits the user to define the keyboard key mappings.";


// ============================================================================
// Utility
// These are currently unused!!!
// ----------------------------------------------------------------------------
"Utility_title" = "Utilities";
"Utility_description" = "Опционални алатки";

"PrefPanel_title" = "Preference Panel";
"PrefPanel_description" = "Инсталира Preference Panel за Chameleon.";

"SMBIOS_title" = "SMBIOS.plist";
"SMBIOS_description" = "Копира пример на smbios.plist во /Extra/Configuration.";

"Documentation_title" = "Документација";
"Documentation_description" = "Документација за Chameleon упатство за инсталација и користење";


// ============================================================================
// Boot Options - The follow options are split to match the layout OptionalSettings text files.
// but they can be changed to suit however anyone wants to do it.
// ----------------------------------------------------------------------------

"Options_title" = "Опции";
"Options_description" = "Подразбирани опции";

"BootBanner_title" = "BootBanner=No";
"BootBanner_description" = "Не го прикажува Chameleon's boot лого во графичкиот интерфејс.";

"GUI_title" = "GUI";
"GUI_description" = "Исклучува графички интерфејс со додавање на GUI=n во org.chameleon.Boot.plist";

"LegacyLogo_title" = "LegacyLogo=Yes";
"LegacyLogo_description" = "Користете го оригиналното (сиво на бело) apple лого наместо boot.png во темата.";

"InstantMenu_title" = "InstantMenu=Yes";
"InstantMenu_description" = "Приказ на екранот за избор на партиција.";

"QuietBoot_title" = "QuietBoot=Yes";
"QuietBoot_description" = "Вклучува тивок boot мод (без пораки и прашања).";

"ShowInfo_title" = "ShowInfo=No";
"ShowInfo_description" = "Disables display of partition and resolution details.";

"Wait_title" = "Wait=Yes";
"Wait_description" = "Прави пауза на boot процесот на Chameleon и чека на притистање на некој тастер пред на стартува mach kernel. Корисно во комбинација со verbose boot за отклонување на проблеми.";

"SkipFTFix_title" = "SkipFTFix=Yes";
"SkipFTFix_description" = "A temporary work around for this breaking RAID booting.";

// ----------------------------------------------------------------------------

"arch_title" = "arch=i386";
"arch_description" = "Користење на 32 битниот мод наместо подразбираниот 64 битен.";

"EHCIacquire_title" = "EHCIacquire";
"EHCIacquire_description" = "Додава EHCIacquire=y во org.chameleon.Boot.plist. Оваа опција поправа секакви EHCI (USB 1.0) проблеми поради некоректно напишани BIOS-и.";

"EthernetBuiltIn_title" = "EthernetBuiltIn";
"EthernetBuiltIn_description" = "Додава EthernetBuiltIn=y во org.chameleon.Boot.plist. Оваа опција ќе ги направи 'вградени' вашите мрежни картички.";

"ForceHPET_title" = "ForceHPET";
"ForceHPET_description" = "Добива ForceHPET=y во org.chameleon.Boot.plist. Вклучува HPET при Intel чипсети за BIOS-и, кој не располагаат со HPET.";

"ForceWake_title" = "ForceWake";
"ForceWake_description" = "Додава ForceWake=y во org.chameleon.Boot.plist. Опцијата дозволува да прескокнете некоректни исклучувања на оперативниот систем.";

"RestartFix_title" = "RestartFix=No";
"RestartFix_description" = "Ја исклучува автоматски вклучената корекција за рестарт.";

"UHCIreset_title" = "UHCIreset";
"UHCIreset_description" = "Додава UHCIreset=y во org.chameleon.Boot.plist. Инициализација UHCI (USB 2.0) контролерите пред стартување на OS X.";

"UseMemDetect_title" = "UseMemDetect=No";
"UseMemDetect_description" = "Исклучува автоматско препознавање на RAM меморијата.";

"UseKernelCache_title" = "UseKernelCache=Yes";
"UseKernelCache_description" = "For Lion only. Enables loading of the pre-linked kernel. This will ignore /E/E and /S/L/E. ONLY use this is you have know it contains everything you need.";

"Wake_title" = "Wake=Yes";
"Wake_description" = "Пробува да вчита sleep image креиран при последната хибернација.";

// ----------------------------------------------------------------------------

"CSTUsingSystemIO_title" = "Generate C-States=Yes";
"CSTUsingSystemIO_description" = "New C-State _CST generation method using SystemIO registers instead of FixedHW.";

"DropSSDT_title" = "DropSSDT=Yes";
"DropSSDT_description" = "Ги отфрла вградените SSDT табели од матичната плоча.";

"EnableC2State_title" = "EnableC2State=Yes";
"EnableC2State_description" = "Enable specific Processor power state, C2.";

"EnableC3State_title" = "EnableC3State=Yes";
"EnableC3State_description" = "Enable specific Processor power state, C3.";

"EnableC4State_title" = "EnableC4State=Yes";
"EnableC4State_description" = "Enable specific Processor power state, C4.";

"GenerateCStates_title" = "Generate C-States=Yes";
"GenerateCStates_description" = "Вклучува автоматско генерирање на C-States за процесорот.";

"GeneratePStates_title" = "Generate P-States=Yes";
"GeneratePStates_description" = "Вклучува автоматско генерирање на P-States за процесорот.";

// ----------------------------------------------------------------------------

"1024x600x32_title" = "1024x600x32";
"1024x600x32_description" = "Set Graphics Mode to 1024x600x32";

"1024x768x32_title" = "1024x768x32";
"1024x768x32_description" = "Set Graphics Mode to 1024x768x32";

"1280x768x32_title" = "1280x768x32";
"1280x768x32_description" = "Set Graphics Mode to 1280x768x32";

"1280x800x32_title" = "1280x800x32";
"1280x800x32_description" = "Set Graphics Mode to 1280x800x32";

"1280x1024x32_title" = "1280x1024x32";
"1280x1024x32_description" = "Set Graphics Mode to 1280x1024x32";

"1280x960x32_title" = "1280x960x32";
"1280x960x32_description" = "Set Graphics Mode to 1280x960x32";

"1440x900x32_title" = "1440x900x32";
"1440x900x32_description" = "Set Graphics Mode to 1440x900x32";

"1600x900x32_title" = "1600x900x32";
"1600x900x32_description" = "Set Graphics Mode to 1600x900x32";

"1680x1050x32_title" = "1680x1050x32";
"1680x1050x32_description" = "Set Graphics Mode to 1680x1050x32";

"1920x1080x32_title" = "1920x1080x32";
"1920x1080x32_description" = "Set Graphics Mode to 1920x1080x32";

"1920x1200x32_title" = "1920x1200x32";
"1920x1200x32_description" = "Set Graphics Mode to 1920x1200x32";

// ----------------------------------------------------------------------------

"GraphicsEnabler_title" = "GraphicsEnabler";
"GraphicsEnabler_description" = "Додава GraphicsEnabler=y во org.chameleon.Boot.plist. Автоматско препознавање на графички карти со nVidia чипсети.";

"UseAtiROM_title" = "UseAtiROM=Yes";
"UseAtiROM_description" = "Вклучува UseAtiROM опции.";

"UseNvidiaROM_title" = "UseNvidiaROM=Yes";
"UseNvidiaROM_description" = "Вклучува UseNvidiaROM опции.";

"VBIOS_title" = "VBIOS=Yes";
"VBIOS_description" = "Вклучува VBIOS oпција";

// ----------------------------------------------------------------------------
// Boot options - KERNEL FLAGS
// ----------------------------------------------------------------------------

"Verbose_title" = "Verbose Mode";
"Verbose_description" = "Turns on verbose logging and allows you to see messages from both Chameleon and the OS X kernel at boot time. Essential for troubleshooting.";

"Singleusermode_title" = "Single User Mode";
"Singleusermode_description" = "A troubleshooting option used for booting into OS X's BSD/Unix command line.";

"Ignorecaches_title" = "Ignore Caches";
"Ignorecaches_description" = "Not an option that's needed for everyday booting, but it can be useful if you want OS X to load all files from it's system folders, rather than relying on it's pre-built caches.";

"Npci_title" = "npci=0x2000";
"Npci_description" = "For overcoming a hang at 'PCI configuration begin' on some systems. 0x2000 is the kIOPCIConfiguratorPFM64 flag, as seen in the IOPCIFamily source code.";

"Darkwake_title" = "darkwake=0";
"Darkwake_description" = "Lion only. Disables the 'low power wake' feature which can sometimes leave the screen black after wake from sleep.";


// ----------------------------------------------------------------------------
// Boot options - KEYLAYOUTS
// ----------------------------------------------------------------------------

"mac-de_title" = "German Mac Keyboard";
"mac-de_description" = "Use the keyboard layout for a German Mac keyboard";

"mac-es_title" = "Spanish Mac Keyboard";
"mac-es_description" = "Use the keyboard layout for a Spanish Mac keyboard";

"mac-fr_title" = "French Mac Keyboard";
"mac-fr_description" = "Use the keyboard layout for a French Mac keyboard";

"mac-it_title" = "Italian Mac Keyboard";
"mac-it_description" = "Use the keyboard layout for an Italian Mac keyboard";

"mac-se_title" = "Swedish Mac Keyboard";
"mac-se_description" = "Use the keyboard layout for a Swedish Mac keyboard";

"pc-fr_title" = "French PC Keyboard";
"pc-fr_description" = "Use the keyboard layout for a French PC keyboard";


// ----------------------------------------------------------------------------
// Boot options - THEMES
// ----------------------------------------------------------------------------

"Embed_title" = "Embed";
"Embed_description" = "Мала едноставна верзија од новата примарна тема што се користи при креирање на верзија од Chameleon што бара вградена тема. ";

"Legacy_title" = "Legacy";
"Legacy_description" = "Chameleon's previous default theme";

"Default_title" = "Стандардна";
"Default_description" = "Вградената тема во Chameleon.";

"Bullet_title" = "Bullet";
"Bullet_description" = "The Bullet тема од NoSmokingBandit";


// ============================================================================
// The filenames from OptionalSettings text files' become sub menu headings.
// These sub menu headings need titles and descriptions.
// ----------------------------------------------------------------------------
// Control

"Control_title" = "Control Options";
"Control_description" = "Settings to control how Chameleon works.";

// General
"General_title" = "General Options";
"General_description" = "Choose from a selection of base options.";

// KernelFlags
"KernelFlags_title" = "Kernel Flags";
"KernelFlags_description" = "Choose from a selection of kernel flags.";

// PowerManagement
"PowerManagement_title" = "Power Management";
"PowerManagement_description" = "A selection of options that deal with power management and speedstep.";

// Resolution
"Resolution_title" = "Резолуција";
"Resolution_description" = "Намесетете ја резолуцијата на вашиот екран";

// Video
"Video_title" = "Video";
"Video_description" = "A selection of options that deal with video.";

// KeyLayout
"KeyLayout_title" = "KeyLayout";
"KeyLayout_description" = "Set one keylayout to use, or select 'None' if you don't want to select a keylayout.";

// Themes
"Themes_title" = "Теми";
"Themes_description" = "Колекција од теми
More themes can be found at http://forum.voodooprojects.org/index.php/board,7.0.html";


// ============================================================================
// Exclusive boot options string - These are added automatically by buildpkg
// Name to be used should be ChooseNone-xxxxxx
// Where xxxxx = the name of the BootOptions file (minus the .txt)
// ----------------------------------------------------------------------------
"ChooseNone-Resolution_title" = "None";
"ChooseNone-Resolution_description" = "Don't choose a resolution.";

"ChooseNone-keylayout_title" = "None";
"ChooseNone-keylayout_description" = "Don't choose a keylayout.";
